# WrappingAtEndsParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WrappingAtEndsParam Property
ParameterTypeId Class See Also
---
"Wrapping at Ends"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WrappingAtEndsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrappingAtEndsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WrappingAtEndsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace